In [2]:
import pandas as pd

indian_weather = pd.DataFrame({
    "cities": ["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
    "windspeed":[80,60,78]
    
})

In [3]:
indian_weather

      cities  temperature  windspeed
0     mumbai           32         80
1      delhi           45         60
2  bangalore           30         78

In [18]:


usa_weather = pd.DataFrame({
    "cities": ["newyork","chicago","orlando"],
    "temperature":[21,14,35],
    "windspeed":[60,65,75]
    
} ,index=[2,1,0])
usa_weather

    cities  temperature  windspeed
2  newyork           21         60
1  chicago           14         65
0  orlando           35         75

In [7]:
df= pd.concat([indian_weather,usa_weather],keys = ["india ","us"])

In [8]:
df

             cities  temperature  windspeed
india  0     mumbai           32         80
       1      delhi           45         60
       2  bangalore           30         78
us     0    newyork           21         60
       1    chicago           14         65
       2    orlando           35         75

In [9]:
df.loc["us"]

    cities  temperature  windspeed
0  newyork           21         60
1  chicago           14         65
2  orlando           35         75

In [ ]:
#if you want to concat as column use axis b

In [17]:
pd.concat([indian_weather,usa_weather],axis = "columns")

      cities  temperature  windspeed   cities  temperature  windspeed
0     mumbai           32         80  newyork           21         60
1      delhi           45         60  chicago           14         65
2  bangalore           30         78  orlando           35         75

In [19]:
indian_weather

      cities  temperature  windspeed
0     mumbai           32         80
1      delhi           45         60
2  bangalore           30         78

In [20]:
c = pd.Series(["rain","sunny","hail"],name="event")

In [21]:
c

0     rain
1    sunny
2     hail
Name: event, dtype: object

In [22]:
pd.concat([indian_weather,c],axis ="columns")

      cities  temperature  windspeed  event
0     mumbai           32         80   rain
1      delhi           45         60  sunny
2  bangalore           30         78   hail